Repository: fpoirotte/XRL
Catalog: docs/i18n/*/LC_MESSAGES/contributing.po
Languages: fr

source: Contributing to XRL
fr: Contribuer à XRL

source: There are several ways by which you may contribute to XRL.
fr: Il existe plusieurs moyens pour contribuer à XRL.

source: Try it!
fr: Essayez le !

source: The more people use it, the better, because it means bugs and regressions can be detected more quickly.
fr: Plus il y a de personnes qui l'utilisent, mieux c'est. Cela permet de détecter les bugs et les régressions plus rapidement.

source: Report Bugs / Suggest Features
fr: Signalez les problèmes / Suggérez des fonctionnalités

source: If you use XRL and find issues with it, please let us know on `GitHub <https://github.com/fpoirotte/XRL/issues/new>`_. Try to provide as much detail as possible on how to reproduce your issue. As a rule of thumb, the easier it is to reproduce an issue, the quicker it gets fixed.
fr: Si vous utilisez XRL et que vous avez identifié un problème, merci de bien vouloir nous en faire part sur `GitHub <https://github.com/fpoirotte/XRL/issues/new>`_. Essayez de fournir autant de détails que possible sur la manière de reproduire le problème. En règle générale, plus le problème est facile à reproduire, plus il a de chances d'être corrigé rapidement.

source: Improve the Documentation
fr: Améliorez la documentation

source: We try to document XRL as much as we can, but acting both as developers and documentation writers, we tend to be biased as to what needs documentation.
fr: Nous essayons de documenter XRL autant possible. Cependant, comme nous sommes à la fois développeurs et rédacteurs de la documentation, nous avons une vision un peu biaisée des éléments qui nécessitent d'être documentés.

source: So if you feel like some parts could be clearer, send us a pull request with your modifications and we'll try to review them as soon as possible. Any help to improve the documentation will be greatly appreciated!
fr: Si vous sentez que certains passages pourraient être mieux explicités, envoyez-nous une pull request avec vos modifications et nous ferons de notre mieux pour la relire rapidement. Toute aide pour améliorer la documentation est toujours la bienvenue !

source: Fork It! And Improve the Code
fr: Clonez et améliorez le code !

source: If you find a bug and have some PHP knowledge and time to spare, grab a copy of the code and have a go at fixing it.
fr: Si vous trouvez un bug, que vous connaissez bien PHP et que vous avez un peu de temps libre, récupérez le code et essayez de le corriger.

source: If you already have a GitHub account, it's quite simple:
fr: Si vous possédez un compte GitHub, c'est assez facile :

source: `Fork the code <https://github.com/fpoirotte/XRL/fork>`_
fr: `Clonez le dépôt <https://github.com/fpoirotte/XRL/fork>`_

source: Hack away
fr: Faites vos modifications

source: `Send a pull request <https://github.com/fpoirotte/XRL/compare>`_ for review
fr: `Envoyez-nous une pull request <https://github.com/fpoirotte/XRL/compare>`_ pour relecture

source: Repeat again starting at step 2
fr: Recommencez à partir de l'étape 2
