Repository: fpoirotte/XRL
Catalog: docs/i18n/*/LC_MESSAGES/index.po
Languages: fr

source: XRL's documentation
fr: Documentation de XRL

source: XRL (short for XML-RPC Library) is a collection of PHP classes that ease the creation of XML-RPC clients or servers.
fr: XRL (abréviation de XML-RPC Library) est un ensemble de classes PHP facilitant la création de clients et de serveurs XML-RPC.

source: This documentation was automatically built from the latest changes on |this_commit|_. It does not necessarily reflect features from any current or upcoming release. Check out https://readthedocs.org/projects/xrl/ for documentation on supported versions.
fr: Cette documentation a été construite automatiquement à partir des dernières modifications apportées sur |this_commit|_. Elle ne reflète pas forcément les fonctionnalités présentes dans une version actuelle ou à venir. Consultez https://readthedocs.org/projects/xrl/ pour la documentation des versions supportées.

source: Overview
fr: Vue d'ensemble

source: **Simple setup** |---| grab the PHAR archive or add ``fpoirotte/xrl`` as a dependency in your :file:`composer.json` and you're good to go.
fr: **Installation facile** |---| récupérez l'archive PHAR ou ajoutez ``fpoirotte/xrl`` aux dépendances de votre :file:`composer.json` et vous êtes fin prêt.

source: **Very intuitive syntax** |---| write XML-RPC clients & servers like you would any other piece of code.
fr: **Syntaxe très intuitive** |---| écrivez des clients et serveurs XML-RPC comme n'importe quel autre code.

source: **Automatic type conversions** |---| use native PHP types without worrying about XML-RPC quirks.
fr: **Conversion automatique des types** |---| utilisez les types PHP natifs sans vous préoccuper des particularités liées à XML-RPC.

source: **Support for many extensions** |---| want capabilities? introspection? multicalls?... yep, :ref:`we support them <extensions>`!
fr: **Support pour de nombreuses extensions** |---| vous utilisez les *capabilities* ? l'*introspection* ? le *multicall* ? ... oui, :ref:`nous les supportons <extensions>` !

source: Setup & Usage
fr: Installation et usage

source: Features
fr: Fonctionnalités

source: Contributing
fr: Contributions

source: XRL is released under the `3-clause BSD licence <https://github.com/fpoirotte/XRL/blob/master/LICENSE>`_.
fr: XRL est distribué selon les termes de la `licence BSD à 3 clauses <https://github.com/fpoirotte/XRL/blob/master/LICENSE>`_.

source: Other resources
fr: Autres ressources

source: `XRL on GitHub <https://github.com/fpoirotte/XRL/>`_ (source code and issue tracker)
fr: `XRL sur GitHub <https://github.com/fpoirotte/XRL/>`_ (suivi de code source et de bugs)

source: `XRL on Packagist <https://packagist.org/packages/fpoirotte/XRL>`_ (Composer repository)
fr: `XRL sur Packagist <https://packagist.org/packages/fpoirotte/XRL>`_ (dépôt Composer)

source: `XRL on Travis-CI <https://travis-ci.org/fpoirotte/XRL>`_ (continuous integration)
fr: `XRL sur Travis-CI <https://travis-ci.org/fpoirotte/XRL>`_ (intégration continue)

source: `XRL on Read The Docs <https://readthedocs.org/projects/xrl/>`_ (online documentation)
fr: `XRL sur Read The Docs <https://readthedocs.org/projects/xrl/>`_ (documentation en ligne)

source: `Full API documentation <./apidoc/>`_ (hosted on Read The Docs)
fr: `Documentation d'API complète <./apidoc/>`_ (hébergée sur Read The Docs)
