Repository: fpoirotte/XRL
Catalog: docs/i18n/*/LC_MESSAGES/quickstart.po
Languages: fr

source: Quick start
fr: Démarrage rapide

source: Assuming XRL is correctly :ref:`installed <setup>` on your computer, you can now write XML-RPC clients and servers.
fr: En supposant que XRL est correctement :ref:`installé <setup>` sur votre ordinateur, vous pouvez à présent coder des clients et serveurs XML-RPC.

source: Writing an XML-RPC client
fr: Coder un client XML-RPC

source: Load and register the autoloader [#note_composer]_
fr: Chargez et enregistrez le chargeur automatique [#note_composer]_

source: Create a new client configured to query the remote XML-RPC server
fr: Créez le nouveau client en le configurant pour qu'il interroge le serveur XML-RPC distant

source: Call a method provided by that server, like it were just any other code
fr: Appelez une méthode fournie par ce serveur, comme vous le feriez avec n'importe quel autre code

source: Writing an XML-RPC server
fr: Coder un serveur XML-RPC

source: Create a new server instance
fr: Créez une nouvelle instance de serveur

source: Attach some methods to that server
fr: Attachez quelques méthodes à ce serveur

source: You can register anonymous functions, closures, global functions, public methods on objects, etc. using the attribute access operator ``->``. You may even use invokable objects!
fr: Vous pouvez attacher des fonctions anonymes, des *closures*, des fonctions globales, des méthodes publiques d'objets, etc. en utilisant l'opérateur d'accès aux attributs ``->``. Vous pouvez même utiliser des objets invocables !

source: Alternatively, you can use the array syntax ``[]`` instead. This is recommended as it avoids potential conflicts with XRL's own attributes and it makes things easier when the method's name is not a valid PHP identifier.
fr: Ou bien, vous pouvez utiliser la syntaxe des tableaux ``[]`` à la place. Il s'agit de l'approche recommandée car elle évite des conflits potentiels avec les attributs internes de XRL et simplifie l'utilisation de noms de méthodes qui ne sont pas des identifiants PHP valides.

source: Handle incoming XML-RPC requests and publish the results
fr: Traitez les requêtes XML-RPC qui arrivent et publiez les résultats

source: Users of the `Composer dependency manager <https://getcomposer.org/>`_ should load the regular autoloader found in ``vendor/autoload.php`` instead.
fr: Les utilisateurs du `gestionnaire de dépendances Composer <https://getcomposer.org/>`_ doivent utiliser le chargeur automatique habituel se trouvant dans ``vendor/autoload.php`` à la place.
