Repository: fpoirotte/XRL
Catalog: docs/i18n/*/LC_MESSAGES/style.po
Languages: fr

source: Coding style
fr: Conventions de codage

source: The XRL team closely follows the `PSR-2 <http://www.php-fig.org/psr/psr-2/>`_ coding style.
fr: L'équipe de XRL suit attentivement les conventions de codage définies par la `PSR-2 <http://www.php-fig.org/psr/psr-2/>`_.

source: Also, when developing, the following command can be used to check various aspects of the code quality:
fr: De plus, lors du développement, la commande suivante permet de vérifier différents aspects de la qualité du code :

source: It runs the following tools on XRL's code to detect possible issues:
fr: Elle exécute les outils suivants sur le code de XRL pour détecter les éventuels problèmes :

source: PHP lint (``php -l``): checks PHP syntax
fr: PHP lint (``php -l``) : vérification de la syntaxe PHP

source: PHP_CodeSniffer: checks code compliance with coding standard
fr: PHP_CodeSniffer : vérification du respect des conventions de codage

source: PDepend: identifies tight coupling between two pieces of code
fr: PDepend : identification des portions de code ayant un couplage trop important

source: PHPMD (PHP Mess Detector): detects high-risk code structures
fr: PHPMD (PHP Mess Detector) : détection des structures de code posant un risque

source: PHPCPD (PHP Copy-Paste Detector): detects copy/paste abuse
fr: PHPCPD (PHP Copy-Paste Detector) : détection des abus de copier/coller

source: PHPUnit: checks unit tests
fr: PHPUnit : passage des tests unitaires
