Repository: fpoirotte/XRL
Catalog: docs/i18n/*/LC_MESSAGES/types.po
Languages: fr

source: XML-RPC Types
fr: Types XML-RPC

source: Supported types
fr: Types supportés

source: XRL supports all the datatypes defined in the `official XML-RPC specification <http://xmlrpc.scripting.com/spec.html>`_, namely:
fr: XRL supporte l'ensemble des types définis dans la `spécification officielle de XML-RPC <http://xmlrpc.scripting.com/spec.html>`_, c'est-à-dire :

source: ``int`` and ``i4``: 32-bit signed integer value
fr: ``int`` et ``i4`` : entier signé sur 32 bits

source: ``boolean``: your usual boolean type
fr: ``boolean`` : le type booléen habituel

source: ``string``: regular string
fr: ``string`` : une simple chaîne de caractères

source: ``double``: double-precision signed floating point number
fr: ``double`` : nombre flottant signé à double précision

source: ``dateTime.iso8601``: date/time (without milliseconds/timezone information)
fr: ``dateTime.iso8601`` : date/heure (sans milli-secondes ni fuseau horaire)

source: ``base64``: base64-encoded binary string
fr: ``base64`` : données binaires encodées en base64

source: ``struct``: associative array
fr: ``struct`` : tableau associatif

source: ``array``: numeric array
fr: ``array``: tableau indexé

source: It also accepts the following types, which are pretty common, despite them not being part of the official specification:
fr: XRL accepte également les types suivants, dont l'usage est plutôt répandu, bien qu'ils ne fassent pas partie de la spécification officielle :

source: ``nil``: null value
fr: ``nil`` : valeur null (absence de valeur)

source: ``i8``: 64-bit signed integer value
fr: ``i8`` : entier signé sur 64 bits

source: Last but not least, it supports the following namespaced types, defined by the `Apache Foundation <http://ws.apache.org/xmlrpc/types.html>`_. Please note that in this particular case, the types must belong to the namespace URI http://ws.apache.org/xmlrpc/namespaces/extensions to be correctly interpreted.
fr: Pour finir, les types suivants appartenant à l'espace de noms défini par la `Fondation Apache <http://ws.apache.org/xmlrpc/types.html>`_ sont aussi supportés. Veuillez noter que dans ce cas particulier, les types doivent appartenir à l'espace de nom ayant pour URI http://ws.apache.org/xmlrpc/namespaces/extensions pour être correctement interprétés.

source: ``nil``: null value (same as the non-namespaced type)
fr: ``nil`` : valeur null (absence de valeur); identique au type sans espace de noms

source: ``i1``: 8-bit signed integer value
fr: ``i1`` : entier signé sur 8 bits

source: ``i2``: 16-bit signed integer value
fr: ``i2`` : entier signé sur 16 bits

source: ``i8``: 64-bits signed integer value (same as the non-namespaced type)
fr: ``i8`` : entier signé sur 64 bits; identique au type sans espace de noms

source: ``biginteger``: arbitrary-length integer
fr: ``biginteger`` : entier de taille arbitraire

source: ``dom``: a DOM node, transmitted as an XML fragment
fr: ``dom`` : élément du DOM, transmis sous forme de fragment XML

source: ``dateTime``: date/time with milliseconds and timezone information
fr: ``dateTime``: date/heure avec milli-secondes et fuseau horaire

source: When transmitting non-standard types, XRL always uses namespaced types. See the next chapter for more information.
fr: Lorsque des types non-standards doivent être envoyés, XRL utilise systématiquement les types appartenant à des espaces de noms. Lisez le chapitre qui suit pour plus d'information.

source: Type conversions
fr: Conversion des types

source: By default, XRL automatically converts values between PHP & XML-RPC types where appropriate.
fr: Par défaut, XRL convertit automatiquement les valeurs entre les types de PHP et ceux de XML-RPC lorsque c'est nécessaire.

source: The following table shows how XRL converts PHP types to XML-RPC types.
fr: Le tableau qui suit montre comment XRL convertit les types PHP vers les types XML-RPC.

source: PHP to XML-RPC conversion
fr: Conversion de PHP vers XML-RPC

source: PHP type
fr: Type PHP

source: XML-RPC type
fr: Type XML-RPC

source: namespaced ``nil``
fr: ``nil`` dans un espace de noms

source: ``i4`` if it fits into 32 bits, namespaced ``i8`` [1]_ otherwise
fr: ``i4`` si le nombre tient sur 32 bits, ``i8`` dans un espace de noms [1]_ sinon

source: ``string`` if it is a valid UTF-8 string, ``base64`` otherwise
fr: ``string`` s'il s'agit d'une séquence UTF-8 valide, ``base64`` sinon

source: ``array`` for numeric arrays, ``struct`` for associative arrays
fr: ``array`` pour les tableaux indexés, ``struct`` pour les tableaux associatifs

source: ``GMP integer`` resource (PHP < 5.6.0)
fr: ressource ``GMP integer`` (PHP < 5.6.0)

source: ``i4`` if it fits into 32 bits, namespaced ``i8`` [1]_ if it fits into 64 bits, namespaced ``biginteger`` [1]_ otherwise
fr: ``i4`` si le nombre tient sur 32 bits, ``i8`` dans un espace de noms [1]_ s'il tient sur 64 bits, ``biginteger`` dans un espace de noms [1]_ sinon

source: ``\fpoirotte\XRL\Types\AbstractType`` object
fr: objet ``\fpoirotte\XRL\Types\AbstractType``

source: XML-RPC type it represents
fr: Type XML-RPC représenté par l'objet

source: ``\GMP`` object (PHP >= 5.6.0)
fr: objet ``\GMP`` (PHP >= 5.6.0)

source: ``\DateTime`` object
fr: objet ``\DateTime``

source: ``dateTime.iso8601`` (using local timezone information by default)
fr: ``dateTime.iso8601`` (en utilisant le fuseau horaire local par défaut)

source: ``\DOMNode`` object
fr: objet ``\DOMNode``

source: namespaced ``dom`` [1]_
fr: ``dom`` dans un espace de noms [1]_

source: ``\XMLWriter`` object
fr: objet ``\XMLWriter``

source: ``\SimpleXMLElement`` object
fr: objet ``\SimpleXMLElement``

source: ``\Exception`` object
fr: objet ``\Exception``

source: XML-RPC fault (derived from ``struct``)
fr: faute XML-RPC (dérivée de ``struct``)

source: The following table shows how XRL converts XML-RPC types to PHP types.
fr: Le tableau qui suit montre comment XRL convertit les types XML-RPC vers les types PHP.

source: XML-RPC to PHP conversion
fr: Conversion XML-RPC vers PHP

source: numeric array
fr: tableau indexé

source: ``\Exception`` object if the structure represents a fault [2]_, associative array otherwise
fr: objet ``\Exception`` si la structure représente une faute [2]_, tableau associatif sinon

source: ``\DateTime`` (using local timezone information by default)
fr: ``\DateTime`` (en utilisant le fuseau horaire local par défaut)

source: namespaced ``nil`` [1]_
fr: ``nil`` dans un espace de noms [1]_

source: namespaced ``i1`` [1]_
fr: ``i1`` dans un espace de noms [1]_

source: integer
fr: entier

source: namespaced ``i2`` [1]_
fr: ``i2`` dans un espace de noms [1]_

source: ``GMP integer`` resource (PHP < 5.6.0) or ``\GMP`` object (PHP >= 5.6.0)
fr: ressource ``GMP integer`` (PHP < 5.6.0) ou objet ``\GMP`` (PHP >= 5.6.0)

source: namespaced ``i8`` [1]_
fr: ``i8`` dans un espace de noms [1]_

source: namespaced ``biginteger`` [1]_
fr: ``biginteger`` dans un espace de noms [1]_

source: namespaced ``datetime`` [1]_
fr: ``datetime`` dans un espace de noms [1]_

source: Using the namespace URI http://ws.apache.org/xmlrpc/namespaces/extensions for compatibility with other implementations.
fr: Avec l'espace de noms portant l'URI http://ws.apache.org/xmlrpc/namespaces/extensions pour la compatibilité avec les autres implémentations.

source: An XML-RPC ``struct`` representing a fault (ie. an error condition) gets converted to an exception that is automatically thrown.
fr: Un ``struct`` XML-RPC représentant une faute (c'est-à-dire une erreur) est convertie en une exception qui est automatiquement levée.

source: Under the hood
fr: Sous le capot

source: Type conversions are handled by the ``\fpoirotte\XRL\NativeEncoder`` class (for PHP to XML-RPC conversions) and ``\fpoirotte\XRL\NativeDecoder`` class (for XML-RPC to PHP conversions), with support from classes in the ``\fpoirotte\XRL\Types\`` namespace.
fr: Les conversions de types sont gérées par les classes ``\fpoirotte\XRL\NativeEncoder`` (pour les conversions depuis PHP vers XML-RPC) et ``\fpoirotte\XRL\NativeDecoder`` (pour les conversions depuis XML-RPC vers PHP), en s'appuyant sur les classes de l'espace de noms ``\fpoirotte\XRL\Types\``.

source: You may override or disable the conversion by passing another encoder/decoder to the XML-RPC client or server constructor.
fr: Vous pouvez surcharger ou désactiver les conversions en passant un autre encodeur/décodeur au constructeur du client ou du serveur XML-RPC.

source: If you change the default encoder/decoder, you will then be responsible for handling conversions to/from the ``\fpoirotte\XRL\Types\AbstractType`` instances XRL uses internally.
fr: Si vous changez l'encodeur/décodeur par défaut, vous devenez gérer vous-mêmes les conversions depuis/vers les instances de ``\fpoirotte\XRL\Types\AbstractType`` utilisées en interne par XRL.

source: XML-RPC faults are handled specially and will always turn into ``\fpoirotte\XRL\Exception`` objects that get raised automatically, no matter what decoder has been passed to the client/server's constructor.
fr: Les fautes XML-RPC sont traitées à part et sont toujours transformées en objets ``\fpoirotte\XRL\Exception`` avant d'être automatiquement levées. Ce comportement est indépendant du décodeur passé au constructeur du client/serveur.
